Mama
treats
daughter
mean
Hes
meanest
man
Ive
ever
seen
badly
Makes
love
madly
takes
money
call
honey
cant
trusted
He
makes
disgusted
All
friends
dont
understand
Whats
matter
tell
mama
lazy
Almost
drives
crazy
squeeze
Still
squeezes
please
heart
aching
believe
breaking
stood
stand
plopped
easy
chair
turned
Channel
bad
gunslinger
called
Salty
Sam
chasin
poor
Sweet
Sue
trapped
old
sawmill
said
evil
laugh
If
give
deed
ranch
Ill
saw
half
And
grabbed
tied
bandsaw
Chorus
along
came
Jones
Tall
thin
Slowwalkin
Slowtalkin
Along
long
lean
lanky
Commercial
got
get
snack
You
shouldve
goin
time
back
Down
abandoned
mine
havin
fits
That
villain
Give
Or
blow
bits
lit
fuse
dynamite
bugged
another
show
But
shootemup
rodeo
tryin
stuff
burlap
sack
Im
gonna
throw
railroad
tracks
threw
train
started
comin
Back
black
hit
Its
glad
Yes
let
loose
From
noose
Thats
kept
hanging
around
looking
sky
gettin
high
Forget
hearse
cause
never
die
nine
lives
Cats
eyes
Cruisin
every
woman
wonderin
Cause
Well
Of
Cadillac
Number
one
bullet
power
pack
bang
With
gang
Theyve
catch
want
hang
track
beatin
flack
Nobodys
rap
So
look
makin
play
Dont
try
push
luck
way
hooo
yeah
Ohh
Oooh
Oh
Out
Woo
gave
Why
wanna
hurt
girl
Are
serious
curious
Just
youre
real
Never
lover
put
pedal
mettle
burn
rubber
Charlie
took
Made
think
everything
fine
Then
upped
ran
away
made
go
Who
metal
told
block
strawberry
pop
When
flat
burned
went
closet
clothes
hangers
poles
phone
mother
OH
oh
Like
clock
wall
dingdingdong
Got
find
wont
gone
She
NO
norepeat
Is
imagination
finally
found
something
worth
living
action
cigarettes
alcohol
could
wait
lifetime
To
spend
days
sunshine
might
well
white
line
comes
top
gotta
make
happen
aggravation
job
theres
nothing
working
situation
need
baby
yo
street
range
rover
cmon
Street
sweeper
cocked
ready
hot
shit
Shimmy
shimmy
cocoa
Listen
pound
Light
take
puff
pass
St
Louis
rolling
dubs
Smoking
clubs
blowing
like
puffs
Sipping
bud
getting
perved
dubbed
Daps
hugs
mugs
shoulder
shrugs
accumulated
enough
stretch
navigate
wood
decorated
chrome
candy
painted
fans
fainted
entertaining
Wild
aint
How
end
Hannibal
Lector
feel
bring
Sing
loud
Lou
proud
Run
mile
righteous
law
Player
styles
raw
born
mack
Todd
Shaw
fame
glamor
ds
hammer
My
grammar
bes
ebonics
gin
tonic
chronic
Fuck
bionic
ironic
slamming
niggas
onyx
Lunatics
til
day
run
game
bulls
sonics
say
pretty
boys
wild
Loud
ok
corral
Foul
club
bust
crowd
nigga
ask
going
Now
come
circus
watch
clown
Pound
giving
Frown
talking
leave
town
Say
hoes
Hey
cut
Play
rules
boo
gon
stay
May
answer
third
question
AI
hi
left
slamma
Memphis
Texas
Indiana
Chitown
Kc
Motown
Alabama
LA
New
York
Yankee
Hotlanta
Louisiana
wit
country
blunts
Savannah
Blow
thirty
mill
Lets
cats
millions
quit
acting
silly
mon
Kid
quicker
Billy
Talking
really
Foes
kick
em
freely
especially
remi
Keys
beemer
holla
Beenie
Man
See
cheifin
deeper
Through
Jennings
youcity
Kingsland
Wit
nice
sheist
snatch
life
Trife
produce
sell
beat
twice
Ice
close
sober
broke
dough
price
knocking
Jehovah
Bill
Gates
Donald
Trump
Spin
lend
We
Benz
Kenwood
ten
inches
win
whoo
fucking
lesbian
twins
Seeing
pen
ends
It
christmas
eve
babe
In
drunk
tank
An
see
sang
song
The
rare
mountain
dew
face
dreamed
lucky
Came
eighteen
feeling
This
years
happy
better
dreams
true
cars
big
bars
rivers
gold
wind
goes
right
place
first
hand
On
cold
promised
Broadway
waiting
handsome
Queen
new
york
city
band
finished
playing
They
howled
Sinatra
swinging
drunks
singing
kissed
corner
danced
night
nypd
choir
Were
galway
bay
bells
ringing
For
Youre
bum
punk
slut
junk
Lying
almost
dead
drip
bed
scumbag
maggot
cheap
lousy
faggot
Happy
arse
pray
God
last
someone
anyone
Cant
alone
built
Twentyfive
cents
hah
wouldnt
pay
twentyfive
nowhere
listen
Up
Harlem
evry
Saturday
highbrows
together
tight
congregates
strut
tuttuttut
Old
Hannah
Brown
cross
Gets
full
corn
starts
breakin
break
hear
Gimme
pigfoot
bottle
beer
Send
gain
care
piano
player
drink
Because
hes
bringin
rhythm
Yeeaah
stomps
feet
sends
sleep
Check
razors
guns
rested
wagon
Do
shimshamshimmy
risin
sun
reefer
sin
What
youve
mamma
pappa
little
dance
water
Reeling
stop
continue
Realize
miser
Confide
wsly
youll
wiser
Young
blood
lovin
upriser
everybody
keep
kaiser
kingpin
pauper
Greedy
people
sea
distress
Keep
receive
less
Unimpressed
material
excess
Love
free
hell
yes
low
brow
rock
know
No
piggies
hoosegow
Get
smart
pow
wow
Bob
Marley
poet
prophet
taught
walkin
talk
Goodness
cough
Lucky
swimmin
ability
Dancin
agility
Come
fertility
Blessed
bucket
mobility
mom
Long
times
scrub
Feelin
good
brother
hug
Drink
juice
young
chugalug
Theres
river
giver
warm
shiver
His
wither
deliver
soul
transplant
operation
Coz
bypass
didnt
function
keeping
toes
Til
Show
magic
mad
Wouldnt
paper
doesnt
TV
hamsters
ate
today
shouldnt
Without
strong
rhyme
step
Think
many
weak
shows
slept
Times
sorry
Thinking
repeating
miss
rhymes
microphone
soloist
sit
radio
dial
soon
As
pump
volume
Dance
speaker
till
plug
headphone
letter
word
heard
control
body
Ditects
tempo
red
alert
Reaches
reflex
work
stuck
steps
set
still
gift
swift
follow
leader
Def
record
mixed
ago
done
clap
hands
start
sink
Into
ink
writing
lines
escape
finish
Picture
mic
stage
empty
tempt
pose
rings
fat
chain
Grab
Soul
Train
mastered
Let
others
brothers
Eric
sticks
Rakim
begin
mix
experiment
scientist
sign
list
manifest
bless
hold
next
encore
Take
respond
thats
itll
erase
waste
controlling
Drop
holding
style
identical
none
Some
sound
upset
wet
sweating
steam
fiend
Eager
MC
theme
hype
drum
roll
teach
name
First
controller
gets
stronger
older
Constant
elevation
causes
expansion
write
cool
mansion
tape
test
Rs
requested
concept
relate
Whoevers
handles
candles
melt
felt
bold
cuz
posse
best
fresh
Uptown
Brooklyn
bound
Bronx
Queens
Island
Sound
Even
states
exact
Since
prove
move
selfesteem
release
rest
peace
spell
Stop
things
Watch
lyin
Yeah
runnin
anyhow
ta
mess
ese
loco
da
flam
Boy
tough
toss
ham
fryin
pan
spam
Slam
Damn
Son
wrek
ya
hectic
Automatic
Genral
Electric
lights
blinking
thinking
drinking
Makin
mind
slow
fuck
fouroh
Bro
maintain
insane
Insane
membrane
brain
undercover
blubber
Blabber
dat
belly
fatter
Fat
boy
diet
check
ass
looter
riot
Much
fast
sumo
slammin
Leavin
grass
chulo
Lightly
Bitch
jealous
outwrite
wicked
smile
Whip
mainframe
explain
Louie
Armstrong
trumpet
bong
somethin
props
Cops
crops
These
pigs
house
Head
underground
raid
pad
blue
scad
pirate
Pilot
ship
ultraviolet
dream
Hide
light
beam
unseen
Look
strain
worry
bout
whats
hurry
tongues
head
mouths
dry
disguise
apologize
fun
groovin
smiling
guiding
deciding
evryday
excuses
offered
anyway
satisfy
Lucille
sisters
married
belong
lead
woke
mornin
sight
asked
lips
played
wonderful
Here
Johnny
Yen
liquor
drugs
flesh
machine
striptease
whered
lotion
hurting
bought
gimmick
About
hypnotizing
chickens
modern
guy
course
ear
lust
million
prizes
torture
film
Drive
GTO
Wear
uniform
government
loan
sleeping
Sidewalk
beating
brains
Your
skin
Itching
buy
Lust
mystery
dollbe
doll
distant
sympathise
uphold
laws
due
form
calli
chorus
neat
neatshe
afford
cannon
gun
crime
cops
chords
crazygot
thought
minds
falls
asleep
feelin
restless
words
upon
creepi
repeat
solo
bit
verse
Orleans
thru
week
quiet
mouse
saturday
usual
admission
cook
waiter
musician
passin
fish
fry
rockin
scufflin
shufflin
dawn
buddy
main
stem
Foolin
decided
use
eat
rampart
knocked
door
opened
ease
lush
even
bat
eye
middle
folks
sam
jivin
jimmies
wife
Over
grand
Being
chicks
wore
expensive
frocks
bobbie
socks
At
particular
women
screamin
jumpin
yellin
outta
wash
kitchen
noise
pots
pans
Way
wear
dresses
shinin
belongs
devil
faster
shake
rattle
Shake
save
doggone
Joe
oneeyed
cat
peepin
seafood
store
child
Ah
hill
underneath
grit
teeth
nothin
act
late
hardly
cannot
Wait
touch
drive
mans
Ford
Behind
bushes
basement
Lock
cellar
Talk
dirty
telephone
hopin
home
whisper
softly
CC
Pick
guitar
andatalk
Whoo
lock
Uh
Ooh
expression
tells
party
gay
leaves
single
doubt
everthing
swing
shout
tis
joint
hats
pianos
thumpin
dancers
bumpin
spot
fact
weapons
Be
sure
quarter
Burn
leather
floor
anybodys
roof
neighbors
knockin
bums
Spoken
Yas
chick
broad
Whered
knock
knees
Put
rid
pistol
yas
talkin
Ha
ha
lets
Party
noises
shouting
Every
Mose
Police
whistle
Uhoh
jug
rug
pig
bread
plenty
switchin
Aw
mercy
hour
bail
jail
Babys
dressd
silver
buttons
High
tipsy
toe
needle
sew
Walkin
dog
awalkin
walk
Asked
fellow
fifteen
jumped
fence
Jumped
touched
fourth
July
Tell
Slim
Razor
Totin
Jim
Butcher
Knife
Annie
Fast
Fanny
pitch
ball
union
hall
romp
tromp
midnight
fuss
fight
daylight
wang
dang
doodle
KuduCrawlin
Red
Abyssinian
Ned
ol
Pistol
Pete
meet
Tonight
windows
doors
Fats
Washboard
jam
Shaky
Boxcar
sawdust
Peg
Caroline
Dye
scent
fill
air
therell
snuff
everywhere
etc
Willie
Dixon
world
fool
joke
arms
farm
fingertips
reaching
achy
breaky
hed
kill
Ma
moved
Arkansas
bite
leg
Cliff
whose
fist
lip
liked
Aunt
Louise
anything
Myself
already
knows
OK
walking
Repeats
Whoaohohohwoha
There
smilin
maybe
shes
kiss
Maybe
hesitate
raise
parking
rate
aall
Watchin
shame
Slow
Lord
trick
Butt
Mine
Gonna
Right
Face
Broad
Daylight
Telling
Feel
Hurt
Mind
Shoot
Kill
Lay
Me
Giving
Count
Three
Stuff
Mouth
Know
Game
Skys
Limit
Really
True
Friend
Have
Seen
Nothing
Bad
BadReally
Whole
World
Has
Answer
Once
Again
Whos
Word
Doin
Wrong
Before
Too
Lyin
Eyes
Make
Fight
Cheap
Not
Throwin
Stones
Hands
Friends
Nothin
Can
Change
Tomorrow
Could
Better
Place
Sayin
Wont
Slap
ItYou
Smooth
Baby
BadYou
KnowHoo
BadIm
sense
Something
important
coming
courage
enjoy
hardcore
gentle
Big
sensuality
met
intimate
huge
included
future
weekend
Carl
Perkins
Two
suede
shoes
lay
Blue
Step
Slander
uhuh
Honey
Steal
car
fruitjar
brass
pocket
Intention
inventive
notice
motion
restrained
emotion
Been
driving
detroit
leaning
reason
seems
pleasing
legs
sidestep
fingers
nobody
else
special
attention
skank
reet
winking
Bye
Ohlove
Hi
doin
tonight
probably
loved
endlessly
werent
lie
bye
two
may
hate
Hmm
truth
welcome
live
would
much
ooh
checkin
signin
loser
leavin
behind
Might
change
strange
Where
Slowly
Faster
cannonball
Someday
Caught
beneath
landslide
champagne
supernova
Wake
dreamer
dies
Wipe
tear
theyre
summer
worlds
spinning
Whywhywhywhyii
background
Ooohoooh
cry
bombs
kids
breathe
Crazy
evenin
breeze
touchin
sweet
singin
calls
kisses
early
moonlight
wonder
pleasures
ohhh
cryin
pain
everybodys
afraid
whos
doohhh
Ahahahah
OooooCrazy
willow
bent
clear
running
stream
Sang
alive
flowing
trouble
school
givin
blues
graduate
Heres
Call
slaver
Dirty
Deeds
Done
Dirt
problems
broken
double
dealin
friend
teardrops
social
lady
guts
keeps
naggin
Enough
nuts
Leave
fee
Concrete
cyanide
TNT
Neckties
contracts
voltage
Searching
adventure
type
Tired
jobs
thanks
must
expect
Youll
lonely
politician
Neither
optician
ought
Noone
grow
second
express
feels
diamond
karat
Fancy
Life
higher
ground
queen
throne
roses
needs
Satin
sheets
romantic
happens
deserve
isnt
Second
Express
Youve
hey
regret
Try
carry
Hell
Darlin
without
golden
yesterdays
wrap
heaven
dyin
moon
satisfyin
Nagasaki
Hiroshima
Fujiyama
Fujiyamayama
erupting
quart
sakey
smoke
chase
tobaccy
shoot
nitroglycerine
stone
deaf
dumb
destruction
atom
bomb
Goldfinger
midas
spiders
Such
finger
Beckons
enter
web
Golden
pour
lies
fear
death
Mister
Pretty
beware
loves
Only
fellas
news
Annies
Her
different
since
ways
rollin
grace
People
jive
One
thing
clarify
guys
Work
hard
couldnt
unwind
saved
Abuse
thousand
however
tried
Heartbreaker
Go
Grandma
powpowpow
round
Everything
upside
Sure
lookin
SF
freak
scene
Fillmore
awasting
Robitussin
Elderberry
wine
hound
snoopin
wag
tail
feed
class
weep
moan
Door
room
inside
House
Anything
plan
Turn
turn
wish
youd
learn
Cut
company
Stone
washed
Whod
tongue
far
sucks
Slurs
resurrection
Id
passion
hates
everlastin
yeahyeah
Huh
knowbut
yeahyeahyeahyeahyeah
allright
Ohhh
yeahyeahyeahyeah
alright
king
bee
Buzzin
hive
able
buzz
buzzin
stingin
awhile
instrumental
Stingabeen
Want
Together
harmonica
messy
whiskers
chin
hung
music
always
used
sittin
creatin
groovy
kind
help
choice
rather
engrossed
mental
chatter
showin
relating
resisting
involvments
image
suspended
looks
kingdom
filled
unknown
imagine
human
toliets
trimmed
Oooooooh
ouh
Everythin
everythin
everythins
whoaw
age
five
greatest
past
lots
mmm
aaa
nnn
represents
mannish
grown
natural
lovers
hoochie
coochie
Sittin
outside
mate
hours
Wasnt
Manchild
resist
Kansas
Stew
cousin
Cocheroo
girls
sittinout
minutes
Aint
manchild
Livin
radar
Lookin
tramp
video
vamp
Demolition
Razzle
dazzle
flash
Television
Sometime
anytime
sugar
Little
ah
innocent
Break
bubble
Pour
Cmon
fire
sticky
yellow
greenalight
Mirror
mannequin
saccharine
loosen
tease
Please
Easy
operator
peaches
cream
taste
lump
bubblebreak
Sugar
tenterhooks
ending
listning
Muzak
chitterchat
Pump
pleasure
centre
sent
propaganda
latest
slander
underhand
Shes
chemical
Though
narcotic
putting
temprature
fashion
bargain
bin
pressure
pin
Fall
submission
hitandrun
transmission
wishing
Last
dancer
dancin
angel
pumping
licence
expires
cried
rebel
yell
More
slavery
beg
tired
sees
brought
Collects
seven
eleven
collect
fare
hair
walked
miles
dried
tears
justa
thinkin
Everyday
vacation
watchin
Fidel
Castro
sand
kissin
Girl
Sister
Havana
Overthrow
bicycle
army
Everybodys
waitin
tower
layin
assassin
lose
holiday
hesitation
rut
manners
theyve
whole
lot
im
papa
sometimes
rich
candle
collar
worker
digger
ditch
messed
changing
filth
ive
given
HEY
Tells
super
Sometimes
Nice
Need
god
jump
huh
Bridge
Righton
brothas
sistas
gimme
Heeeeey
scream
horns
Shout
Said
Good
Super
richer
sad
harder
helpless
smarter
stressed
chillin
Sold
survivor
goinna
survive
survivin
Thought
inhaling
Perfect
vision
lastin
livin
fail
self
destruct
wishin
Pray
blessed
Bring
success
stress
happiness
blast
family
magazines
compromise
Christianity
diss
internet
After
darkness
sadness
Soon
surround
positive
prosperity
plain
near
bar
Until
tall
bulletproof
Each
chance
Knew
Bout
kicking
Superman
pick
opponents
Holding
kryptonite
Youd
lesson
paying
dues
general
consensus
Repeat
backstroke
hidin
neath
covers
talked
daddy
muffin
achangin
cheerleader
bleeder
reminisce
sister
seesaw
swingin
flyin
diddle
kitty
missy
wasnt
foolin
knew
knowed
schoolgirl
sweetie
classy
kinda
sassy
skirts
climbin
knee
three
ladies
gym
locker
noticed
missed
neighbor
favor
substitute
Mmh
mmh
alot
lately
Used
pamper
Usta
brag
seem
peachy
keen
neglect
dinner
breath
dancing
couch
wed
starve
Gods
earth
tellin
thankful
Soap
opera
says
wrong
itUh
swear
uh
Yo
La
la
Eves
sexy
gangsta
cowards
misfit
spit
trash
Wrist
glist
cash
glance
dorag
Slang
speech
drop
crowds
Broads
screw
smash
changed
gritty
supposed
simple
dizzy
broads
fuckin
Natural
hustlin
bitch
slot
Exec
dawg
ownin
dot
coms
scared
Eve
prepared
Realness
reality
Attitude
rude
Philly
thrill
Breath
chest
listenin
shorty
Bet
known
frontin
vouch
behavior
Same
Sixteen
pence
cop
Bottom
questions
Power
moves
everyday
thorough
Imma
bank
shine
yall
borderline
bullshit
exactly
clueless
Dispose
flow
Heat
growing
son
owe
mommy
Song
paid
followin
swallow
shuv
Betcha
blame
Looking
morning
rain
uninspired
unkind
key
lostandfound
claim
Till
helped
longer
doubtful
fell
tent
beyond
movie
downtown
somebody
telling
winds
Ohhhhhhhhh
Libraries
us
shallow
piece
dignity
scars
allowed
design
turning
feedin
jukebox
guess
dime
Chairs
stacked
tables
closing
forever
theyd
Anywhere
Throug
Another
stairway
climb
Time
believed
anyday
Anyway
someday
glass
twist
knife
Booker
William
Bell
Born
crawl
Hard
read
havent
learned
Wine
crave
legged
grave
Loretta
Lynn
coal
miners
cabin
Holler
shovel
dollar
worked
Vanleer
field
hoein
Mommie
rocked
Bible
oil
morn
Daddy
raised
eight
scrubbed
washboard
bleed
complain
smiled
mommies
understanding
summertime
wintertime
brand
pair
mail
order
catalog
selling
hog
managed
somewhere
remember
drew
anymore
memries
Cry
nights
sat
shed
realise
fall
vain
Hmmm
Lovely
Fever
Temperatures
Risin
Force
Vow
Happen
Asks
Questions
Closer
Body
Touch
Fire
Desire
Melting
Hot
Candle
Wax
Sensation
Us
Hours
Complanin
Heartbreak
Enemy
Despise
Eternal
Shines
Alright
Feeling
shell
mighty
ahurry
barn
Dontcha
harm
burning
deep
hide
Our
troubles
begging
helpin
cup
joe
explodin
yourselve
lost
darkened
Lean
drown
Hold
cover
suffer
reach
satisfaction
quick
reaction
travel
mountains
highways
valleys
biways
flowers
Candy
moonbeams
Fill
While
birdies
sing
Tie
knot
string
Gotta
Help
Oooohhh
freeway
Driving
trying
Ooohh
Believe
highway
freeways
streets
alleys
florida
farther
join
history
demonstration
freedom
nation
Five
score
great
American
symbolic
shadow
signed
Emancipation
Proclamation
momentous
decree
beacon
hope
slaves
seared
flames
withering
injustice
joyous
daybreak
captivity
hundred
later
colored
America
sadly
crippled
manacle
segregation
chains
discrimination
island
poverty
midst
vast
ocean
languishing
corners
society
finds
exile
land
dramatize
shameful
condition
nations
capital
architects
republic
wrote
magnificent
Constitution
Declaration
Independence
signing
promissory
note
heir
promise
men
guaranteed
inalienable
rights
liberty
pursuit
obvious
defaulted
insofar
citizens
color
concerned
Instead
honoring
sacred
obligation
marked
insufficient
funds
refuse
justice
bankrupt
vaults
opportunity
demand
riches
security
also
hallowed
remind
fierce
urgency
engage
luxury
cooling
tranquilizing
drug
gradualism
democracy
rise
dark
desolate
valley
sunlit
path
racial
lift
quicksand
solid
brotherhood
children
fatal
overlook
moment
underestimate
determination
sweltering
peoples
legitimate
discontent
invigorating
autumn
equality
Nineteen
sixtythree
beginning
Those
Americans
needed
content
awakening
returns
business
neither
tranquility
citizen
granted
citizenship
whirlwinds
revolt
foundations
bright
emerges
satisfied
bodies
heavy
fatigue
lodging
motels
hotels
cities
persons
basic
smaller
ghetto
larger
stripped
selfhood
robbed
signs
stating
person
Mississippi
vote
believes
rolls
waters
righteousness
unmindful
trials
tribulations
areas
quest
battered
storms
persecutions
staggered
police
brutality
veterans
creative
suffering
Continue
faith
unearned
redemptive
South
Carolina
Georgia
slums
ghettos
knowing
somehow
wallow
despair
difficulties
tomorrow
deeply
rooted
meaning
creed
truths
selfevident
created
equal
hills
sons
former
slave
owners
table
state
heat
oppression
transformed
oasis
four
judged
character
vicious
racists
governor
dripping
interposition
nullification
shall
engulfed
exalted
rough
places
plains
crooked
straight
glory
revealed
hew
transform
jangling
discords
beautiful
symphony
struggle
thee
Land
fathers
died
Pilgrims
pride
mountainside
ring
become
hilltops
Hampshire
heightening
Alleghenies
Pennsylvania
snowcapped
Rockies
Colorado
curvaceous
slopes
California
Mountain
molehill
tenement
hamlet
speed
Jews
Gentiles
Protestants
Catholics
Negro
spiritual
Free
Thank
Almighty
anybody
axe
handle
graveyard
frame
tombstone
bullets
wearin
balls
drinkin
smokin
screwball
overhere
square
lotta
Also
younger
Ere
bonnie
boat
sailed
mystic
Hark
sailors
Smell
spirit
fly
fog
horn
blows
gypsy
magnificently
float
London
calling
faraway
towns
war
declaredand
battle
underworld
cupboard
phony
Beatlemania
bitten
dust
Cept
truncheon
ice
zooming
Engines
wheat
nuclear
error
drowningand
imitation
zone
zombies
Quit
outand
draw
callingand
talkingI
nodding
highs
Except
yellowy
Fool
rip
date
Picked
Shag
flying
Walk
unto
toy
furious
ashamed
conscience
guide
IIIII
forget
foolish
short
sorrow
Hiding
shadows
Living
Dark
toll
stole
Keeps
Theyre
darling
psychiatrist
doctor
degree
IQs
Freedom
games
careful
eachother
weary
Wearing
shaggy
dress
tenderness
anticipating
possessnono
gentlemen
Ohbut
sentimental
greaves
soft
spoken
easier
bear
Them
Tenderness
Squeeze
ou
nownownow
Rub
soothe
Move
zak
tendernes
lord
Twist
Beatles
RussellMedley
closer
woo
Camelot
Jack
Jacqueline
Che
Guevara
filling
gasoline
Castros
spies
crying
luxurys
disappointment
walks
thinks
warn
Third
Soviet
Union
blinded
By
resumption
testing
reminded
Dr
Robert
Oppenheimers
optimism
hurdle
Cheese
Pavilion
stacking
chairs
mopping
spilt
asking
basking
fanzine
writer
Mixing
Pop
Politics
asks
offer
embarrassment
corridor
van
Great
Leap
Forwards
Jumble
sales
organised
pamphlets
posted
parties
hosted
active
activists
sleepers
leap
forward
leaps
Will
politics
blacklist
Top
Pops
drawing
dole
Start
revolution
middleman
perfect
tune
Revolution
Tshirt
Waiting
Catching
westbound
number
Holy
Creek
county
Boss
Lazy
Horsehes
howlin
catches
ride
Pa
moonshine
Drinkin
Deacon
bathtub
preachin
savin
souls
Yellin
tries
Bobbie
Sues
lowcut
mistake
stumblin
Full
Deacons
Swearin
acussin
kin
Westbound
fade
treat
pa
send
mam
misery
aw
Birdland
whatd
Anda
Naw
uhuhuh
minute
ho
Woah
Awh
Woooah
Mother
Brother
dying
weve
loving
Father
father
escalate
conquer
Picket
picket
punish
Everybody
judge
Simply
cos
Would
Lend
ears
Mm
Does
certain
Searchin
insanity
hatred
funny
Ohhhh
troubled
downhearted
harmony
slippin
Raised
promises
balcony
waves
crashin
beach
desperate
crept
memory
painful
covering
USA
hometown
rifle
Sent
foreign
refinery
Hiring
Went
VA
Khe
Sahn
fighting
Viet
Cong
Saigon
picture
penitentiary
gas
fires
road
Nowhere
rocking
whatever
Babe
doorway
DuoSolo
Weve
Pretending
shy
Friday
share
Talkins
spare
Mymymymymy
Evry
growin
joy
stare
Beggin
whisky
amp
Dry
wastin
Ow
Grrooss
happened
snake
shaking
crawling
Oo
ee
hoo
small
anywhere
Houston
Neil
singer
smokey
smell
perfume
Strangers
boulevard
Their
searching
Streetlights
Working
wants
Payin
dice
believin
Streetlight
truly
guarantee
Smile
powers
voices
saying
Killing
faces
musics
runaround
rolled
punches
answers
tend
naw
Seekin
oooh
wave
flag
plays
Hail
chief
point
senators
fortunate
spoon
taxman
rummage
sale
millionaires
inherit
star
spangled
military
garage
detector
Carbon
monoxide
making
effective
offers
garageland
Meanwhile
hotting
West
End
Contracts
offices
groups
bummin
slummin
boots
group
suits
clever
guttersnipes
twentytwo
singers
players
Complaints
Wot
bag
watching
side
moving
shelter
thoughts
wheels
beauty
elevator
hotel
yorba
vacancy
lake
leading
sitting
front
porch
stomping
wooden
boards
locking
childish
cathedral
priest
least
grab
umbrella
favourite
fella
rocks
fought
race
Robbin
sixgun
beggin
brown
shirt
Didnt
count
advice
anyplace
dare
Thursday
Wednesday
yet
winner
Fingernails
Meet
screaming
fallen
season
passes
voice
Stay
mattered
shattered
expecting
desert
fit
discarded
Pull
floorcome
wanted
surely
Surely
Than
thunder
lightning
frightening
superstitious
spinnin
trance
secret
means
Knock
Ya
Pony
Boney
Maroney
Mash
potato
alligator
hips
backbone
slip
watootsie
Lucy
Na
nananana
nananananananananana
Wow
Playing
habit
Sally
Twisting
Doing
Roll
jerka
Fell
scarlet
remover
Yesterday
blew
Having
direction
Upside
psychotic
removal
shaker
Making
Shooting
Things
Gone
Always
Tellin
Closing
Pullin
wool
Actin
uses
open
taking
chances
sick
advances
Mickey
goodnight
chills
pity
hooves
Wo
damn
looked
Turned
familiar
closed
slipped
dreaming
Marianne
Yet
recall
wander
Took
smog
factory
spill
climbed
highest
Above
onto
disgrace
starting
wages
bloody
CHORUS
grew
Circled
underpass
Died
punks
choked
resalled
fears
Running
heartless
concrete
Chasing
ideas
solved
either
dimmer
receded
appealing
sinner
Rescue
tender
charm
rescue
part
Mmmhmm
mmmhmm
Ba
na
Chakachaka
chakachaka
chaka
team
substituting
whichever
rooting
motor
Flyin
foot
Fords
burnin
Underneath
hood
movin
ill
patrol
barely
ford
Guess
wildeyed
thatd
Havent
Told
Boys
chic
shakin
steamin
Johnnys
slapped
er
Spread
spread
theyll
dressed
Dinos
grill
drinks
kid
blasting
warmer
Buddy
mud
Kicking
Singing
Shouting
Waving
banner
Pleading
Somebody
forty
Rock
haze
Connie
Freddy
King
pokers
Abooze
Four
chaquitas
Omaha
Was
return
detective
outasight
dudes
proceeded
Band
Oooooo
ticket
Hear
drummer
crew
Black
Attack
japped
MacIntosh
mike
favoritism
Lazer
anastasia
maze
Ways
blaze
forgiven
flex
avoid
paranoid
Gear
Rhetoric
Read
quittin
though
Signed
rhymer
jerked
Changin
Raw
metaphysically
followed
code
dropped
load
hustler
culture
Snakebitten
fittin
Respects
hows
protect
defect
reckon
intentional
wreck
Played
intellect
Broke
fault
fallin
Known
fair
Throughout
growl
foul
bone
Terrordome
Subordinate
terror
Kickin
era
Cold
deliverin
Bronco
Crucifixion
fiction
chosen
frozen
Apology
pleases
Jesus
sync
Backstabbed
lab
Rab
rag
Sad
sold
quiver
clue
plus
Lies
scandalizin
basin
Traits
celebratin
satan
rope
dope
Bobbin
weavin
pit
pendulum
bendin
Snakes
blowin
Tryin
blind
science
snedin
Cannot
suicide
nerve
criticize
Squeezed
Malcom
shootin
Huey
Newton
Nigger
pulled
trigger
speak
destroy
nothings
worse
mothers
slain
Bensonhurst
decide
fate
dedicate
Places
racist
example
cases
Greek
Virginia
Beach
wildin
bass
drums
violins
Watcha
gitcha
physically
sweaty
cha
controllin
Fear
kickin
Droppin
Brain
intellectual
Vietnam
Welcome
Thirty
Anyone
Which
hole
Ohyeah
Chicago
Green
Lebanese
coke
napalese
Sneeze
buzzed
Newcastle
smack
greasy
whore
urban
Durban
Poison
lessen
Solo
sneeze
busted
jailhousebound
Fade
seeing
usta
kindsa
falling
green
eyed
although
northern
parents
reputation
generation
improve
station
deviation
Pedal
communication
everyone
ladder
rung
Dreams
unfulfilled
unskilled
beats
pickin
cotton
forgotten
bastards
daughters
Clean
womb
boom
Elvis
Income
tax
deduction
Unwillingness
ones
visit
graves
holidays
consolation
Youngtake
JettK
Fowley
fox
Hello
hello
Mom
ch
cherry
sounds
causen
teenage
sore
choose
scotch
crotch
Buy
yacht
sayin
coast
critics
Clay
Aiken
Radiohead
Britney
Spears
lasts
Madonna
bet
hiphop
Cobo
Detroit
City
mccoy
Names
blastin
plaster
tearing
shore
Breakdown
iwas
sweatin
bittersweet
stockings
aow
loosin
headin
drain
quesey
swell
limit
aahhh
Yea
caught
yea
harp
Hat
holdin
cane
Jumpin
stickin
untill
beter
Conrad
Guitar
com
ahh
waw
waahhhh
fingernails
Click
Swallows
Texarkana
chew
Nervous
clickin
tickin
apartment
ninetyninth
window
Imagining
stopped
flies
pounds
detergent
cloud
twos
fed
peaceful
laid
tickets
screen
Nebraska
whinin
twenty
fields
Headin
knowin
travelin
blazin
turnin
Had
beside
Baptist
southern
funky
teacher
counter
bustin
pickup
truck
Denver
commie
member
flashin
sirens
pinch
dreamin
Loveland
Pass
drizzlin
thundershower
drivin
Caddy
Fog
lifted
starin
policeman
trooper
nerves
gracious
laughed
moooooved
Kiss
wooo
wellllll
sooo
nails
twiddle
thumbs
nervous
switch
bake
rider
Ahh
Jenny
spendin
Spinnin
nownownownow
spin
Intro
engine
petrol
Gurumobile
Cos
rocket
inner
space
orbit
Groove
beatonce
Dig
happening
Hitch
Partymachine
Real
Cool
wig
flip
fIy
Supersonic
chandelier
pilots
bombardier
Oowee
Capracornia
Catch
Somewhere
Yever
case
girlfriend
yknow
Sitting
classroom
drag
Listening
noon
cue
Smokin
Acheckin
halls
stalls
Fang
Paul
book
bored
Teacher
indeed
mo
fully
aware
twistin
melon
hip
rainmaker
taken
stamp
desire
plans
stranger
Tongue
lied
creep
jerk
rot
diseased
ahhh
North
pappy
brewed
lightnin
Mighty
pleasin
pappys
squeezin
Whshhhoooh
revenuers
brew
acookin
Instrumental
White
stead
sip
Lightnin
Shhhoooh
slicker
powerful
sslug
drank
moaning
Note
version
reversed
ssip
Luckll
stars
turns
paradise
Did
often
changes
cute
bunny
stolen
mousy
dig
distracted
Women
ravin
skinny
Skinny
gals
imperceptible
scat
title
verses
wah
swept
whee
talks
finest
penthouse
mohair
suit
pockets
spending
loot
dueling
scar
Chills
spine
romance
Romance
looker
goodbye
whirl
frettin
grievin
strife
pleasant
dining
pheasant
serve
tomatoes
mashed
potatoes
cottage
spacious
wide
laughter
Sounds
corny
seedy
indeedy
monthlong
trip
oceanliner
leaving
roam
picked
Dialed
Ali
Dodge
Dart
yard
Shaheed
covered
greenbacks
drove
Belt
Conduit
destination
Drove
twodaysandahalf
risen
dusty
figure
sombrero
index
tipped
hat
El
Segundo
Pedro
directions
pronto
Needed
civilization
sort
reservation
south
food
Thanks
senor
Tip
describe
wallet
passed
grub
pub
ordered
enchiladas
fruit
punch
hunch
Pay
lunch
Pulled
waitress
stared
heres
checked
keys
numbers
jimmy
hotter
curse
badder
Chitchitchatter
scatter
Breaking
Northeast
Jettin
seepd
slack
Madison
Sha
Hopped
torpeed
shack
Left
gotgot
cept
kneeling
force
shining
submerge
swimming
circle
Someone
healing
unashamed
DEEP
WITHIN
MY
HEART
LIES
MELODY
SONG
OF
OLD
SAN
ANTONE
WHERE
IN
DREAMS
LIVE
WITH
MEMORY
BENEATH
THE
STARS
ALL
ALONE
ENCHANTMENT
STRANGE
AS
MOON
UP
ABOVE
FOR
THAT
MOONLIT
PASS
ONLY
HE
WOULD
KNOW
STILL
HEARS
BROKEN
LOVE
YOUR
SPLENDOR
KNOWN
TO
CALL
BACK
ROSE
LIPS
SO
SWEET
AND
TENDER
LIKE
PETALS
FALLING
APART
SPEAK
ONCE
AGAIN
OWN
EMPTY
WORDS
PATH
BY
ALAMO
BREAK
REPEAT
VERSE
TAG
TWICE
Sunshine
awindow
Couldve
tripped
abut
achanged
Itll
Any
sunset
ait
hmm
slowly
Lantern
anothin
turtle
dive
pearls
youyouyou
athinking
velvet
rainbows
ayou
ahave
Across
everybodyd
surfin
baggies
Huarachi
Sandals
bushy
blond
Surfin
Del
Mar
Ventura
Country
Line
Santa
Cruz
Tressels
Australias
Nabarine
Manhattan
Doheny
plannin
route
waxing
surfboards
June
safari
Haggartys
Swamis
Pacific
Palisades
San
Onofre
Sunset
Redondo
Jolla
Waiamea
Bay
Wipeout
planning
TIMES
Boston
Pittsburgh
Deep
Frisco
StLouis
Famed
autographs
pictures
Becomes
excited
Mommy
steal
Whisper
Bandstand
Philadelphia
Tight
lipstick
sportin
heel
Shell
trend
sixteen
thell
ona
Apple
plum
apricota
eh
Figs
dates
grapes
cakes
Interlude
Christmas
tree
Marriage
pomegranate
Peach
pear
Eastaegg
housea
Trailer
rent
Rooms
letfifty
pool
pets
buttwo
pushin
broom
Buys
twelve
fourbit
boxcar
DestinationBangor
Maine
worn
stogies
Short
engineer
names
handout
locked
Trailers
fifty
Whenever
pout
Isnt
amazing
grows
couple
thank
lovely
Ad
lib
Enought
Silly
Songs
Around
Wanna
Explain
Feelings
Plain
Gave
Doesnt
Minute
Loved
Loveyou
Thick
wavy
skips
wearing
shades
MM
bulky
sweaters
match
prize
tapered
pants
button
John
Mitchy
itchy
folk
Zal
Denny
workin
penny
coffee
Sebastian
McGuinn
McGuire
agettin
except
Cass
Zally
arent
golly
Night
Owl
sophomore
planned
Swarthmore
Standin
turnpike
thumb
hitchhike
bumps
Called
Mugwumps
aimin
jumps
slumps
formed
Spoonful
Michelle
tuneful
acatchin
Didididit
dit
didididit
whoa
agents
fake
eventually
Greasin
cards
heats
Duffys
vibrations
imaginations
indefinitely
becomin
Blueberry
Hill
lingered
Loves
melody
vows
Tho
apart
Chewing
Walking
snow
Highway
Seasons
Alligator
lizards
Wishin
Sorry
Purple
books
ole
Helped
homework
bitty
willing
request
Sallys
Hardest
neighborhood
Selling
neck
ties
whod
favorite
despised
wound
millionare
Jitterbug
Goes
somethings
bugging
instead
yoyo
tonite
gray
skies
brighter
Doris
Day
mere
spark
flame
per
cruel
Cuddle
bid
farewell
starfish
worst
secrets
confide
ornament
carin
Stolen
storys
rollercoaster
nearly
quotMistadobalina
Mr
Dobalina
Mistadobalina
Mistabobdobalina
fraudulent
behave
rugrat
tip
tabloid
mock
mission
hawk
happenin
foes
suppose
everythings
apparel
adopted
homies
DEL
cronies
CMPX
Mista
Ooooo
ooooo
mistadobalina
manipulate
teachers
stump
schooled
moneygrip
honeydip
serpent
agree
twotima
resembles
Jemima
jeans
hoodie
disguises
sizes
shapes
facade
snakes
vapes
year
GQ
mask
Timberlake
Kwame
responded
foe
strength
Hercules
dick
heed
groupie
Guadeloupee
neva
clowns
jesters
suggest
impress
Uncle
Fester
dobolina
remembering
anda
Ruby
Whatd
Ima
ghost
haunt
sometime
cries
wise
Whoa
Heyhey
saida
sets
aflame
Doncha
givea
nowFADE
Coming
somen
fret
Steve
educated
stock
pull
boyfriend
Cowboys
Theyd
diamonds
Lonestar
belt
buckles
faded
levis
begins
probly
Mamas
babies
cowboys
guitars
trucks
doctors
lawyers
rooms
mornings
puppies
Sailing
cardboard
canvas
Hanging
muslin
honkytonk
parade
arcade
Barnum
Bailey
Backfield
penalize
Off
Offside
Holdin
cheatin
Ffakin
balking
strike
Fourth
Cus
backfield
FADE
Travel
pal
confidant
Stand
bow
Invited
biggest
card
attached
lack
Whatever
canes
Milky
ascend
bah
baba
Maria
Papa
shut
waited
beau
huggin
normal
crickets
anyones
repetoire
Suddenly
uncle
dozen
dozencame
Dodododo
Imagine
invest
skiesll
Babababa
babababa
ba
weather
POS
Magic
community
Mase
Dove
Difficult
preaching
Posdnuos
Pleasure
stimulates
measure
Measure
parts
Casually
seein
actions
monkeys
hop
hustle
Unless
Brewster
Brewsters
Punky
Parents
Criticising
phrasin
Fred
Astaires
offended
dosedos
tricamera
Fly
stored
DAISY
production
stands
quotDa
Inner
Yallquot
showing
deejay
emcee
speakers
De
consists
DOVE
pie
dessert
dine
darn
effect
quotMmmmquot
daisy
Showing
position
Kissin
missin
negative
fills
casualty
subtract
partner
adjective
odd
Pos
Focus
flaunts
Souls
flaunt
praises
Common
scrolls
Scrolls
written
daily
creates
Listeners
wisdom
Wisdom
Speaker
Plug
Set
aside
legal
substance
dialect
factor
Speakers
forms
sum
fix
muscle
Space
lumber
Advance
Woahwoahwo
shangalang
subway
chats
Anybody
audience
rising
Susie
wake
movies
oclock
Whatta
oohlala
goofed
plot
goose
cooked
shot
Saw
standin
relax
Cashed
escapade
Escapade
worries
Worked
Ready
fond
fancy
Diamond
clips
emerald
traffic
Napoleon
Waterloolala
debutantes
British
wellknown
Hed
France
Romeo
Grabs
reveal
Tallula
Tellula
foola
breathing
Hollywood
Strip
Neon
scantily
kicks
DC
Antone
Liberty
Baton
Rouge
Tulsa
Austin
Oklahoma
Seattle
Francisco
Everywhere
bands
Cleveland
Ahhhhhh
oooooo
disappear
Lovin
Ahhhhh
Monday
Evrybody
nag
tuesday
TonightI
bugs
Today
dollywell
dolly
dollyi
glowinyoure
crowinyoure
swayinwhile
playin
songs
fellasfind
lap
Dollyll
Sogolly
gee
awayi
rumor
hearin
stories
noone
Thered
crumble
complication
celebration
sweetest
sensation
dreamings
arunning
faking
fantasy
II
ATisket
ATasket
basket
mommie
girlie
market
truckin
Avenue
peck
peckin
spied
birthday
bath
fright
cake
present
Raindrops
Flowers
flower
simply
seemed
park
showed
sunny
Sunny
mePd
Pd
Flying
kites
Kites
kite
Laughing
flight
drops
caress
blouse
zillion
Dad
Says
Cherry
groove
Mmmm
whyaint
exciting
lighting
completely
hugged
sailor
quote
grinnin
beginnin
beeyooteeful
kingsize
notion
devotion
bluest
deepest
adore
forest
birds
realize
sever
sneakin
doorstep
Held
tightly
hickeys
butterflies
Funny
innocence
fades
bitter
memories
Lovers
crushed
infidelity
suck
caramel
apple
lollypops
Rain
sleet
troopin
Murdock
socialize
peeps
whipped
flipped
feelings
Mirrors
ceiling
afternoon
surrendered
temperature
separate
Smiled
Understand
Okay
bridge
Mmm
held
Taste
climax
occupyin
lessons
strictly
bend
backwards
emotional
support
Stayin
average
sour
bond
sweetheart
begun
waltz
wondrin
defenses
messin
fillin
senses
stylish
Very
amazed
girldivdiv
idlyrics
classPRINTONLY
lyrics
available
printing
div
tearin
lettin
Folks
bees
thangs
story
Minnie
Moocher
redhot
hootchiecootcher
roughest
toughest
frail
whale
response
differs
following
simplified
Hidehidehidihi
Hodehodehodeho
Hedehedehedehe
Hodehodeho
bloke
named
Smoky
cokie
Chinatown
gong
Sweden
needin
steel
platinum
wheel
townhouse
racing
horses
meal
courses
dollars
nickels
dimes
counted
billion
Poor
Min
Rider
adone
Wowo
acome
shotgun
Lala
amy
ababy
Away
awont
amissin
meant
awaitin
hesitatin
Stars
appear
acalling
alovin
Comin
Park
chute
awful
roller
coaster
loop
merrygoround
tunnel
Ferris
across
git
greet
sax
Eeeyeah
Alets
FADES
Lonely
Find
Silent
footsteps
crowding
Sudden
tea
Datndoodowdowdatndoodow
silence
Quiet
movements
Grabbing
Jocko
hasnt
standing
tripping
Nature
Splendid
callin
smokefilled
goodies
Lady
Getting
mood
seventeen
Dancing
tambourine
teaser
Dearly
beloved
gathered
afterworld
shrink
Beverly
Hills
Everythingll
Ask
Cuz
Ure
deelevator
Punch
friendly
purple
banana
grim
reaper
Pills
thrills
daffodils
Hang
Holiday
Celebrate
celebrate
Celebration
Josey
Wales
robbin
trains
remains
duel
heaters
morgue
downlow
shits
Wayne
gangbang
Horsemen
click
Bonanza
bacon
eggs
whorehouse
Hop
enforcers
fearless
location
map
rush
gots
lookaday
Kurupt
Quick
Jesse
James
aim
th
Horny
Corral
hearda
Tha
forcify
Besides
mash
coach
disciples
rifles
lethal
posts
offtherocker
sixshooter
holster
DPG
Wanted
poster
gank
teller
shank
stacks
skirt
snatched
Dogg
hogg
drawin
board
Nowadays
drawn
wards
Battle
saddle
getcha
shaken
clean
slugs
spleen
hack
sixshooters
jacket
cock
strap
LBC
Crew
Doggystyle
individual
hots
six
shots
plots
stashed
bags
Worthy
workers
Russian
blabbermouths
gags
excell
Clydesdales
smooth
decoy
horse
stoppin
Box
nosey
Headed
saloon
platoon
hos
trail
bailed
Gold
spurs
Gators
clientele
recop
Divide
Azz
sacks
heist
mounted
Rode
west
toward
rundown
walls
sweat
Heard
headed
horsey
straps
napsack
Giddy
rode
threaten
Undebts
Chief
beads
hail
weed
toke
beadspipe
destiny
stops
slid
Gs
sidewalk
Comeon
comeon
Despite
evening
Dressing
wheezing
bus
stairs
rooftop
cares
toys
Girls
Cute
pony
tails
curls
Must
sporting
marches
jitterbug
settle
Participate
Clams
rollerskates
Rollerskates
backbeat
jazz
awail
admit
hurrican
jubilee
jokey
jamboree
shook
tango
Mood
mambo
congo
sights
Feels
Smoke
fag
Sleep
Lost
controls
sucker
decision
Sooner
Save
deck
seas
rotten
Soomer
runaway
stupid
reasons
bother
Fellator
Bust
tale
overzealous
females
smarty
clad
sex
Poindexter
Next
luncheon
Food
serving
stonecold
munchin
Music
split
gawking
Sits
likes
fatso
cure
ugly
frustration
inclination
monk
celibate
Theater
row
Guys
jokes
witty
fakin
goodness
sakin
brings
sadistic
materialistic
opportunistic
perpetrating
tan
strollin
runs
Harry
Larry
marry
ceremony
neato
libido
church
tuxedo
bride
wedding
bridesmaid
winks
firm
Receptions
pumpin
Chevrolet
suntanned
crewcut
AllAmerican
male
Remember
ruined
soda
recognize
sneakers
September
Ooooh
Jukebox
fading
graduation
Jose
Ahhhahhhahhh
Doctor
MD
ailin
fever
Ooooooowwwwwwww
Yourself
jungle
kangaroo
mumblin
mr
landlord
Johns
rarin
whether
rainy
Birds
feather
stick
Nibblin
sponge
tourists
Strummin
shrimp
boil
Wasted
Margaritaville
salt
nobodys
Stayed
tattoo
Mexican
cutie
flop
Stepped
cruise
booze
blender
render
concoction
helps
Woke
hangover
babys
Double
potion
intro
Verse
hurtin
sufferin
ecstasy
flips
shoutin
yahhah
isa
dove
Coda
organ
riff
athere
outa
athinkin
convertible
ahere
wanting
ridin
sharp
adreamin
id
aknockin
fortyone
fiftynine
weight
Rampart
Canal
gather
Wah
waah
waaaah
twisting
storm
Praying
funkythigh
collector
Layin
lectric
tigers
vaseline
Mars
ad
inf
tsittin
asingin
guest
Ooee
ooee
bended
trockin
rack
boogie
woogie
tmovin
poppin
Finger
breaks
Mary
Bobby
eightwheeler
Means
truelovin
movinon
southland
fireman
Tennessee
rattler
Engineer
throttle
rattlers
fastest
vow
switched
triflin
warned
stayed
avenue
milkman
Ridin
gipsies
unfaithful
strangers
plumb
claudette
pet
holler
feelins
packed
swore
pine
lovins
Truckin
chips
cashed
dodah
Arrows
neon
flashing
marquees
Main
typical
involved
daydream
Dallas
Yorks
Most
layem
Other
Lately
occurs
became
Jane
sparkle
reds
vitamin
cocaine
Buffalo
mellow
Takes
warrant
Busted
Bourbon
bowlin
Knocked
hangin
revoke
patch
bones
Ride
Atlanta
GA
sho
furthermo
Twelfth
Vine
plane
Nobody
spoil
income
barbacue
sparkel
meter
jet
engines
whine
babbling
SOLO
suddenly
developed
Desdemona
conventions
Lift
jute
Seine
fourteen
Boulevard
Rue
Fourteen
Toulouse
Lautrec
Painted
naked
nude
porter
Mason
Dixie
bell
puffin
frost
Southern
Lonesome
soil
Riding
automobile
curiosity
Crusin
anxious
sincere
leaned
whispered
Cuddlin
parked
Kokomo
stroll
unfasten
safety
calaboose
aloose
grudge
budge
Early
supper
courthouse
Willy
picks
Poorboys
nickel
tap
Rooster
hits
Blinky
thumps
gut
solos
Poorboy
twangs
kalamazoo
doubles
kazoo
East
Monroe
meets
doney
allow
barman
haircuts
boss
language
Following
overgrown
moss
trees
wallets
nooh
conversation
mover
strolled
transportation
clickity
clack
lonesome
stack
democratic
fellows
Mac
Choo
choo
chboogie
alas
alack
compensation
knack
Live
Riley
beatendown
peak
crack
ballin
jack
Universal
Amphitheatre
preprogrammed
electronic
disco
master
bluesmen
practicing
craft
exist
classical
records
department
local
public
libraries
Illinois
Joliet
Jake
Elwood
Blues
Brothers
Bright
stakes
Viva
Las
Vegas
twentyfour
poker
roulette
fortune
deal
arm
bandits
hopes
nighttime
Turnin
daytime
costs
evrything
viva
tastes
fussing
trunk
Money
Jeans
Spend
ADoing
Homework
BAll
Week
AHouse
Empty
BFolks
NC
Ooo
Housell
Shaking
Bare
Feet
Slapping
Floor
Sit
Guard
Outside
Home
Afraid
Therell
Movies
Round
Usual
Cares
Content
safe
Push
someplace
Hugs
wishes
eternity
surrender
mouth
disprove
talent
crush
sensitive
impossible
respected
Whys
complicated
hated
cynics
wholl
theory
idea
surrounded
conflict
disregard
angle
angels
tales
biting
crayons
letters
soar
Sir
twinkle
shooting
blazed
Yours
Rolled
shackled
bonds
stains
backroads
memry
clinging
ivy
Planted
columns
binds
cursing
forgiving
junkyards
stain
dip
soup
gurglin
Cracklin
caldron
beard
roughning
pile
cupped
tin
pretend
breast
waving
Ever
wherefore
disagree
coat
pouring
Nothings
hurts
ego
deflated
overrated
Goodbye
Songwriters
Yvonne
Harvey
Tony
Hatch
WELBECK
MUSIC
LTD
restaraunt
aww
explains
weeks
Late
couldve
patiently
Beachwood
bearded
barley
Nightly
Swing
milky
twilight
Lead
moonlit
Strike
fireflies
Silver
moons
sparkling
tire
flowered
ActioNextcom
Disappearing
indistinct
horizons
reload
arrow
equine
nebulae
fantastic
blindly
hollow
Growing
greater
quantity
freer
revolved
accelerating
spirals
asymmetric
Stewart
wings
bluebird
sings
alarm
shavin
stings
Cheer
Sleepy
Jean
believer
homecoming
knight
steed
interlude
missing
Miss
kissing
dyou
embrace
Loneliness
Oohoo
Thingsll
lighter
rays
lace
roads
Sharing
Watching
ahead
depend
Ohohoh
ohoh
guilty
useless
Pain
Mmmhmmhmm
Mmmmmmm
Ohoh
wondering
tie
proof
BRIDGE
RAP
shakesay
shoulders
sake
forgave
trust
build
Solid
Somehow
seperate
understood
odds
sweeter
Seems
Linger
thingsll
Downtown
finer
bossa
nova
Guide
sweater
Gee
aswingin
chewin
gum
juicy
silk
stockins
Awearin
skintight
Ivy
League
Carry
ahold
mmmm
prettiest
loveliest
glow
Forever
Loveliest
possible
senselessness
within
paints
palomine
whoaohoh
Whose
oohoohoohooh
darlin
longin
Whoauhoh
Moon
Crack
Coffee
leaking
foreman
grin
cookin
earning
returning
bald
tires
credit
grind
Alfie
fools
rule
nonbelievers
Goin
chapel
maaarried
Spring
Todays
Bells
theee
kittens
copper
kettles
woolen
mittens
packages
strings
Cream
ponies
crisp
strudels
Doorbells
sleigh
schnitzel
noodles
geese
satin
sashes
Snowflakes
nose
lashes
winters
springs
bites
feeel
refill
wakes
sleepwalking
sweettalking
loaded
mark
pure
Unaware
underlined
figured
celebrated
separation
excelled
complete
uncovered
pancakes
maple
syrup
yolks
smiley
spots
mirror
towels
momma
Consoled
hearts
Hearts
brush
cap
pjs
mostly
Kind
untrue
poured
throws
spins
squirrel
slammed
bike
silvertooth
grins
Meeting
Heaven
specially
skipped
fandango
cartwheels
seasick
humming
flew
tray
miller
ghostly
whiter
shade
pale
wandered
vestal
virgins
pointed
detail
forced
Saying
mermaid
Neptune
sweetly
anger
straightway
likewise
dirt
Seemed
crashdived
quickly
attacked
Ahhhhhhhhhhhhhhhhhhhhhhhh
Hate
unreal
Incomplete
sighs
Ahhhhhhhhhhhhhhhhhhhhhhhhh
slate
triggers
hurtful
plates
fuzzy
interstate
Fuzzy
hunger
replace
bouquet
dear
Lied
Should
listened
brick
dogs
howl
plant
plow
howling
owl
woods
Hunting
horney
toad
Beyond
vodkas
tonics
replacement
Mongrels
Sniffing
tidbits
replied
denied
chaffed
gaily
flown
laughing
deride
amends
Somethin
spirits
Entertaining
passersby
Wrapped
confusion
purpose
reap
heal
mourn
cast
stones
refrain
embracing
rend
confess
Sundown
creepin
winnin
losin
sleepin
harvest
watched
afar
Twenty
cost
coin
tossed
Rolling
Lullabies
Wed
village
twentyone
lived
perfumed
undone
thirtyfive
blueblooded
independent
limousines
chauffeurs
vintage
kegs
brim
dregs
Released
Vocals
Colin
Blunstone
Keyboards
Rod
Argent
Bass
Chris
Drums
Hugh
Grundy
Atkinson
damp
lanes
Beechwood
pleasured
lands
scratch
itch
Rich
parlor
truckers
kickers
cowboy
damned
prairies
grain
calico
bonnet
Cheyenne
switchman
lantern
Billboards
truckstops
grievous
shown
amphetamine
crown
unbuckling
bible
lighted
remembered
Key
grant
Miles
highbeam
deadly
safely
strummed
possess
page
shortly
airplane
prairie
heartbreak
wilderness
canyon
bosom
abraham
saving
boulder
birmingham
hardest
ninety
thousands
islands
unions
filing
Trod
HERE
MalkmusS
Kannberg
Pavement
sung
Stuart
vary
slightly
original
printed
laughs
prayer
Everythings
sterile
striking
Defends
dock
forehead
mists
hire
stance
randomly
outlet
portrait
minions
Crotch
mavens
Spanish
unsold
runon
mount
Trembles
shivers
spent
crystal
flake
Italian
winter
Retired
duraflames
Shining
collapsing
carts
box
colorful
lifting
sensing
challenge
prayers
losing
unadmired
beings
dread
roofs
doves
Jimmy
Bringing
Headless
Shiver
Hating
brittle
Sinking
Skin
Wherever
Brittle
messiah
clapping
Children
Piper
piping
Drummers
drumming
sharing
bringing
caring
shattering
jewels
clasping
Truth
grasping
learning
yearning
Pink
pink
winding
Hair
sunflower
messing
Sunshower
pines
oak
hickory
Callin
crowded
easily
palm
Gypsy
began
lilac
crucifix
ledge
spider
fastening
ankle
hidden
razor
blade
brave
eyelids
Found
pipe
difficult
Broken
steering
pissed
saint
resting
comic
Wheels
alien
grounds
Colours
Fading
grasp
colours
johnny
walker
shoots
torn
enchanted
tarot
magazine
lying
attitude
tvs
frames
comedy
recalls
vanished
oblivion
clouds
worried
overcome
scrape
colour
rushing
Eternity
treasure
answered
Ladies
floating
giant
lifes
drift
Fox
starving
hungry
kills
cycle
Bowlin
Prettiest
Kentucky
unfold
warms
touches
Grass
owns
softest
clicking
weeps
reminds
behindwait
Miami
takin
Greyhound
Hudson
River
Rockys
evergreens
rhythym
Daily
News
slide
Riverside
respect
Quite
reformed
wonderworld
superstar
finepressed
Combed
combed
contentment
actors
actor
uncomprehending
Wore
Daniel
traveling
heading
Spain
Teardrops
mommas
Different
Theyll
Rows
flows
castles
canyons
sides
illusions
Moons
Junes
fairy
Tears
schemes
heads
gained
frightened
hush
overhear
novoices
matters
teardrop
Si
te
quire
de
verdad
felicidad
Te
deseo
lo
mas
bueno
palos
dos
Pero
si
hace
llorar
mime
puedes
hablar
estare
contigo
cuando
treste
estas
deadend
glimpse
faker
ChchchchChanges
ChchChanges
trace
ripples
size
impermanence
immune
consultations
quite
Wheres
necks
Strange
fascination
fascinating
Changes
pace
rollers
fuses
cinnamon
abuse
Threatened
speaks
Others
Promised
hitching
Harder
Whoaoooohhhoh
cafe
recalling
Whoaohoooohhh
deserted
fickle
spring
deserved
Kept
Joey
Molland
mend
Penetrates
infection
Gives
mention
alienate
procession
seeking
obsession
thens
Mrs
Molly
Jenkins
sells
wares
Saturdays
farmhands
sows
gown
wretch
farmers
trades
milk
snuggles
barroom
Horace
stays
Sends
seams
drowns
reborn
pious
boozy
claims
pretends
reading
halffilled
marriage
Sunday
breakfast
reads
rustling
squeak
surprised
Giant
Xs
ransom
sunflowers
david
aAnd
confused
witha
BridgeOh
IIIIm
Faaallin
Oooooh
Anna
searchin
Breaks
December
Gazing
freshly
silent
shroud
fortress
penetrate
friendship
disdain
disturb
slumber
poetry
shielded
armor
spotted
planes
Leaving
vapor
trails
bleak
terrain
hexagram
heavens
Amelia
false
drone
scrambles
seasons
becomes
travelogue
picturepostcardcharms
obey
kindly
leads
cursed
charmed
aviation
swallowed
Icarus
ascending
icy
altitude
crashed
Cactus
Tree
Motel
shower
pillows
wanderlust
geometric
farms
alarms
weepin
Cryin
pillow
gloomy
LAST
pieces
Pretend
adds
awhat
wawawawawonder
Ahwhywhywhywhywhy
runrunrunrunrunaway
Musitron
Arunrunrunrunrunaway
wink
handmedown
weekday
moments
oven
regrets
moonin
Moanin
nicotine
fiddle
bolt
problem
final
yesterday
reacted
dell
fireline
empire
expected
rejected
Blood
springtime
October
Buried
Feed
Christ
deny
maker
wasted
sewn
Shove
stormy
Tuesdays
Wednesdays
Thursdays
eagle
kneel
Trying
intentions
misunderstood
carefree
edgy
regretting
fallacies
rose
Forbidden
Curtises
despise
Covered
belief
fantasies
sinful
screens
Bear
facts
assume
dye
oo
decent
Scattered
seeds
buried
Mysteries
revolve
Circumstance
ashtray
darkest
wept
veins
bloodier
metallic
discover
Sweethearts
lordy
lower
Lower
bathysphere
Between
coral
eel
swordfish
swim
imagined
curiousness
potential
misty
Many
shared
opposition
Comes
arising
dreadful
blacking
Alone
wives
whoring
smiles
unbeaten
lovings
Phenomenally
properly
seconds
severed
funk
Karmacoma
suburbs
bodys
Duplicate
Kuwait
uwait
Jamaica
Aroma
Roma
careless
delicate
sins
guidance
defense
criminal
redeemed
sinned
deeds
consequence
cleanse
bettin
looooooooooooooooooooooooooove
uhh
uhhhhhh
haaayyyyyyyyyyyyy
yeahhhhhhh
yeahhhhhhhhhh
hiyee
ehhh
blinds
spits
mistakes
Switch
Calling
zero
thick
doubts
Crashing
twists
Changing
Spinning
yarns
cuts
Cuts
court
session
verdict
appeal
docket
cage
Screams
burns
fuels
selfish
captive
shines
meek
distance
loss
lion
roars
holds
burden
eternally
Banging
mourning
Seeking
Gabriel
confirms
prison
ohI
Shouldve
banging
CARLOS
RIA
hero
tortured
twentyodd
career
doped
religion
classless
peasants
Los
Angeles
asshole
Mouse
cow
Daves
kissy
rear
view
zen
Raindogs
century
steak
search
demigod
violence
Zen
digging
basis
seldom
cools
temper
doubled
kuwait
Jamaican
aroma
Monopoly
TVs
pills
speyside
Salt
asphalt
littering
topsoil
Tune
Sign
bled
greed
drunken
miserable
valuable
entwined
Caligula
blushed
naturally
fled
Karma
arrest
math
buzzes
fridge
detuned
Hitler
hairdo
payroll
crossed
fixed
captain
chocolates
faithful
discreet
Joes
ribbons
bows
Plague
artifact
disclose
Calvary
Malibu
Sacred
Heart
Lightning
crashes
placenta
opens
closes
Belongs
chasing
Forces
pullin
center
Pale
iris
Presents
puts
Under
cancel
killing
Unwillingly
Fate
starlit
cruelly
sail
ships
bridges
define
moral
tumbling
nigh
remove
cosmos
okay
bottom
gladly
adored
Adored
motorcycle
recognition
Drying
insides
sussed
mistaken
Lived
vocations
completion
harbor
misfortune
heavenly
Tambourine
sleepy
jingle
jangle
evenins
returned
Vanished
weariness
amazes
branded
ancient
swirlin
grip
numb
boot
heels
wanderin
laughin
aimed
escapin
fences
facin
vague
traces
skippin
reels
ragged
Seein
disappearin
foggy
ruins
haunted
windy
Far
twisted
Silhouetted
circled
sands
driven
aches
stake
hiding
unwise
unfurled
awaken
imagining
tumble
indulgence
decline
wipe
Fracture
enemy
lipprint
biddy
wid
spliff
sensei
BDP
Shan
Marl
demarhymin
Pickin
dem
Queensbridge
gwan
agaaain
teell
Didi
dida
di
didi
diday
aiy
sucka
KRSOne
bo
DJ
Scott
LaRock
favors
Boogie
Productions
flavors
flavor
savor
suckin
Roxanne
Shante
steady
bluffin
Doug
Fresh
nuthin
Compared
Alert
KISS
routine
Square
ooooooooooooooooooooooo
Marlon
wack
Puma
sneaker
Juice
Parchman
Farm
puttin
guage
pianosolo
Nine
dreamboat
footnote
editions
longing
Chapter
tricks
Chapters
Six
paragraphs
compliments
cutting
remarks
captured
quotation
marks
difference
fighter
electric
typewriter
sequel
Elis
acomin
aheartache
Apollo
